<a href="https://colab.research.google.com/github/EricOliveira17/Data-Science-Projetos-Portfolio/blob/main/Python_Pandas_e_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

By - Eric Oliveira

#####QUANDO NÃO TEMOS DADOS EM MÃOS, NÃO HÁ O QUÊ ENTREGAR DE VALOR EM QUALQUER ANÁLISE, RESTA ADQUIRIR ESSES DADOS EM ALGUMA FONTE. E PARA ISSO EXISTE A LINGUAGEN DE CONSULTA ESTRUTURADA (SQL) PODENDO RESOLVER ESTE TIPO DE PROBLEMA.

### FAZENDO CONSULTAS SQL COM : PYTHON + PANDAS + SQLalchemy

In [ ]:
# IMPORTAÇÃO DOS PACOTES NECESSÁRIOS 

from sqlalchemy import create_engine
import pandas as pd

In [ ]:
data = pd.read_excel('/sdcard/PROJETOS PORTIFÓLIOS/Planilha_to_SQL.xlsx')
 
# Criação do motor e conexão com o banco de dados SQlite rodando em memória 
engine = create_engine('sqlite:///:memory:')
 
# Armazena o dataframe como uma tabela no disco
data.to_sql('data_table', engine)
 
# Primeira Query na tabela relacional 
# Selecionei a tabela inteira , carregada pelo motor == "engine".
res1 = pd.read_sql_query('SELECT * FROM data_table', engine)
print('Resultado 1')
print(res1)
print('')
 
# Segunda Query
# Agupei por departamento e somei os salários distribuidos por departamento da tabela "data_table"
res2 = pd.read_sql_query('SELECT dept,sum(salary) FROM data_table group by dept', engine)
print('Resultado 2')
print(res2)

Resultado 1
   index  id    name  salary                  start_date        dept
0      0   1   Rick      623  2012-01-01 00:00:00.000000          IT
1      1   2     Dan     515  2013-09-23 00:00:00.000000  Operations
2      2   3   Tusar     611  2014-11-15 00:00:00.000000          IT
3      3   4    Ryan     729  2014-05-11 00:00:00.000000          HR
4      4   5    Gary     843  2015-03-27 00:00:00.000000     Finance
5      5   6   Rasmi     578  2013-05-21 00:00:00.000000          IT
6      6   7  Pranab     632  2013-07-30 00:00:00.000000  Operations
7      7   8    Guru     722  2014-06-17 00:00:00.000000     Finance

Resultado 2
         dept  sum(salary)
0     Finance         1565
1          HR          729
2          IT         1812
3  Operations         1147